# Brewfile
#
# Maintained by Cai Cooper

### Keyboard & Mouse {{{
  # A simple utility application to trigger haptic feedback when tapping Touch Bar
  cask 'haptickey'
### }}}


### Terminal {{{
  # GPU-accelerated terminal emulator
  cask 'alacritty'
  # Powerlevel10k is a theme for Zsh
  tap 'romkatv/powerlevel10k'
  brew 'romkatv/powerlevel10k/powerlevel10k'
#}}}


### Font {{{
  # XML-based font configuration API for X Windows
  brew 'fontconfig'

  ## Font Family: Icons
  # Most popular icon toolkit
  cask 'homebrew/cask-fonts/font-fontawesome'
  # Simple and Minimal Line Icons
  cask 'homebrew/cask-fonts/font-simple-line-icons'
  # Material Design icons by Google
  cask 'homebrew/cask-fonts/font-material-icons'
  # An iconic font made for developers
  cask 'homebrew/cask-fonts/font-devicons'
  # WordPress admin icon font
  cask 'homebrew/cask-fonts/font-dashicons'
  # The premium icon font for Ionic Framework and web apps everywhere
  cask 'homebrew/cask-fonts/font-ionicons'

  ## Font Family: Powerline
  cask 'homebrew/cask-fonts/font-consolas-for-powerline'
  cask 'homebrew/cask-fonts/font-hack-nerd-font'
  cask 'homebrew/cask-fonts/font-menlo-for-powerline'
  cask 'homebrew/cask-fonts/font-meslo-for-powerline'
  cask 'homebrew/cask-fonts/font-monoid-nerd-font'
### }}}
